cases/FPCM16__4plus8cells_lcmFoam23mules_slipwall/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (resin air);

resin
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 0.0000625;
    rho             rho [ 1 -3 0 0 0 0 0 ] 960;
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.47e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.225;
}

sigma            sigma [ 1 0 -2 0 0 0 0 ] 0.0;  


// ************************************************************************* //
