cases/FPCM16__4plus8cells_lcmFoam23mules_slipwall/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


actions
(
    // Example:pick up internal faces on outside of cellSet
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Load initial cellSet
    {
        name    porosity1_PP;
        type    cellSet;
        action  new;
        source boxToCell;
        sourceInfo
        {
            box (-1 -1 0) (1 1 1 );
        }
    }

    // Get all faces in cellSet
    {
        name    porosityPP;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set     porosity1_PP;
        }
    }

    // Load initial cellSet
    {
        name    porosity2_DM;
        type    cellSet;
        action  new;
        source boxToCell;
        sourceInfo
        {
            box (-1 -1 -1) (1 1 0 );
        }
    }

    // Get all faces in cellSet
    {
        name    porosityDM;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set     porosity2_DM;
        }
    }

);

// ************************************************************************* //